ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S16-EVK/LPC55S16_Blinky_RAM/board/pin_mux.h
/*! @name FC7_SCK (number 76), U13[29]/J9[13]/FC7_I2S_BCLK
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI2SPINS_FC7_I2S_BCLK_PERIPHERAL FLEXCOMM7
/*!
 * @brief Signal name */
#define BOARD_INITI2SPINS_FC7_I2S_BCLK_SIGNAL SCK
/*!
 * @brief Routed pin name */
#define BOARD_INITI2SPINS_FC7_I2S_BCLK_PIN_NAME FC7_SCK
/*!
 * @brief Label */
#define BOARD_INITI2SPINS_FC7_I2S_BCLK_LABEL "U13[29]/J9[13]/FC7_I2S_BCLK"
/*!
 * @brief Identifier */
#define BOARD_INITI2SPINS_FC7_I2S_BCLK_NAME "FC7_I2S_BCLK"
/* @} */

/*! @name FC6_RXD_SDA_MOSI_DATA (number 2), J18[2]/J9[19]/FC6_I2S_RX
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PERIPHERAL FLEXCOMM6             /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_FC6_I2S_RX_SIGNAL RXD_SDA_MOSI_DATA         /*!<@brief Signal name */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PIN_NAME FC6_RXD_SDA_MOSI_DATA   /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_FC6_I2S_RX_LABEL "J18[2]/J9[19]/FC6_I2S_RX" /*!<@brief Label */
#define BOARD_INITI2SPINS_FC6_I2S_RX_NAME "FC6_I2S_RX"                /*!<@brief Identifier */
                                                                      /* @} */

/*! @name PIO1_25 (number 77), J9[15]/J12[5]/I2S_IRQ
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_I2S_IRQ_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_I2S_IRQ_SIGNAL PIO1                       /*!<@brief Signal name */
#define BOARD_INITI2SPINS_I2S_IRQ_CHANNEL 25                        /*!<@brief Signal channel */
#define BOARD_INITI2SPINS_I2S_IRQ_PIN_NAME PIO1_25                  /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_I2S_IRQ_LABEL "J9[15]/J12[5]/I2S_IRQ"     /*!<@brief Label */
#define BOARD_INITI2SPINS_I2S_IRQ_NAME "I2S_IRQ"                    /*!<@brief Identifier */
#define BOARD_INITI2SPINS_I2S_IRQ_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITI2SPINS_I2S_IRQ_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITI2SPINS_I2S_IRQ_GPIO_PIN 25U                      /*!<@brief GPIO pin number */
#define BOARD_INITI2SPINS_I2S_IRQ_GPIO_PIN_MASK (1U << 25U)         /*!<@brief GPIO pin mask */
#define BOARD_INITI2SPINS_I2S_IRQ_PORT 1U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_I2S_IRQ_PIN 25U                           /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_I2S_IRQ_PIN_MASK (1U << 25U)              /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name MCLK (number 91), J13[7]/J13[8]/U13[28]/I2S_MCLK
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI2SPINS_I2S_MCLK_PERIPHERAL SYSCON
/*!
 * @brief Signal name */
#define BOARD_INITI2SPINS_I2S_MCLK_SIGNAL MCLK
/*!
 * @brief Routed pin name */
#define BOARD_INITI2SPINS_I2S_MCLK_PIN_NAME MCLK
/*!
 * @brief Label */
#define BOARD_INITI2SPINS_I2S_MCLK_LABEL "J13[7]/J13[8]/U13[28]/I2S_MCLK"
/*!
 * @brief Identifier */
#define BOARD_INITI2SPINS_I2S_MCLK_NAME "I2S_MCLK"
/*!
 * @brief Direction */
#define BOARD_INITI2SPINS_I2S_MCLK_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC5 0x05u         /*!<@brief Selects pin function 5 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name FC4_RXD_SDA_MOSI_DATA (number 30), U12[6]/U13[3]/J8[6]/J9[4]/FC4_I2C_SDA
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief Routed pin name */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PIN_NAME FC4_RXD_SDA_MOSI_DATA
/*!
 * @brief Label */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_LABEL "U12[6]/U13[3]/J8[6]/J9[4]/FC4_I2C_SDA"
/*!
 * @brief Identifier */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_NAME "FC4_I2C_SDA"
/* @} */

/*! @name FC4_TXD_SCL_MISO_WS (number 4), U12[4]/U13[2]/J8[5]/J9[2]/FC4_I2C_SCL
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_SIGNAL TXD_SCL_MISO_WS
/*!
 * @brief Routed pin name */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PIN_NAME FC4_TXD_SCL_MISO_WS
/*!
 * @brief Label */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_LABEL "U12[4]/U13[2]/J8[5]/J9[2]/FC4_I2C_SCL"
/*!
 * @brief Identifier */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_NAME "FC4_I2C_SCL"
/* @} */

/*! @name PIO1_26 (number 68), U12[11]/J12[13]/J12[17]/ACC_INT_EXP_P1_26
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_ACCL_INTR_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_ACCL_INTR_SIGNAL PIO1
/*!
 * @brief Signal channel */
#define BOARD_INITACCELPINS_ACCL_INTR_CHANNEL 26
/*!
 * @brief Routed pin name */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN_NAME PIO1_26
/*!
 * @brief Label */
#define BOARD_INITACCELPINS_ACCL_INTR_LABEL "U12[11]/J12[13]/J12[17]/ACC_INT_EXP_P1_26"
/*!
 * @brief Identifier */
#define BOARD_INITACCELPINS_ACCL_INTR_NAME "ACCL_INTR"

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO GPIO
/*!
 * @brief GPIO pin number */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO_PIN 26U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO_PIN_MASK (1U << 26U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INTR_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN 26U
/*!
 * @brief PORT pin mask */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN_MASK (1U << 26U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC9 0x09u         /*!<@brief Selects pin function 9 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name CAN0_TD (number 85), U26[3]/CAN_TXD
  @{ */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN_TXD_PERIPHERAL CAN0        /*!<@brief Peripheral name */
#define BOARD_INITCANPINS_CAN_TXD_SIGNAL CAN_TD          /*!<@brief Signal name */
#define BOARD_INITCANPINS_CAN_TXD_PIN_NAME CAN0_TD       /*!<@brief Routed pin name */
#define BOARD_INITCANPINS_CAN_TXD_LABEL "U26[3]/CAN_TXD" /*!<@brief Label */
#define BOARD_INITCANPINS_CAN_TXD_NAME "CAN_TXD"         /*!<@brief Identifier */
                                                         /* @} */

/*! @name CAN0_RD (number 41), U25[3]/CAN_RXD
  @{ */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN_RXD_PERIPHERAL CAN0        /*!<@brief Peripheral name */
#define BOARD_INITCANPINS_CAN_RXD_SIGNAL CAN_RD          /*!<@brief Signal name */
#define BOARD_INITCANPINS_CAN_RXD_PIN_NAME CAN0_RD       /*!<@brief Routed pin name */
#define BOARD_INITCANPINS_CAN_RXD_LABEL "U25[3]/CAN_RXD" /*!<@brief Label */
#define BOARD_INITCANPINS_CAN_RXD_NAME "CAN_RXD"         /*!<@brief Identifier */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
